<template>
  <div class="service-page">
    <div class="service-bg">
      慧展云DIY服务协议
    </div>
    <div class="wrap">
      <p>甲方：西安博奥软件科技有限公司（以下简称“我方”）</p>
      <p>乙方： “慧展云”的注册用户（以下简称“用户”或“您”）</p>
      <h1>一、服务条款确认</h1>
      <p>1、本协议是您与西安博奥软件科技有限公司（以下简称“麦伦文化”）之间的新协议，博奥软件根据本协议为您提供服务。慧展云是，博奥软件所拥有的网站、手机客户端及相关服务，慧展云的所有权、运作权和解释权归西安博奥软件科技有限公司所有。</p>
      <p>2、您确认：在您开始“慧展云”产品试用或购买前，您已充分阅读、理解并接受本协议的全部内容，一旦您选择“同意”并开始使用本服务或完成购买流程，即表示您同意遵循本协议之所有约定。不具备前述条件的，您应立即终止注册或停止使用本服务。</p>
      <p>3、若您代表公司使用慧展云提供的服务时，在此您须特别承诺有权代表公司，您对本协议的接受将被自动视为您所代表的公司对本协议的接受。</p>
      <p>4、我方有权在需要时对本协议内容进行单方面的变更，毋须另行通知。修订后的条款一旦在我方官网上公布即有效代替原来的服务协议。若您在本协议内容公告变更后继续使用本服务，表示您已充分阅读、理解并接受修改后的协议内容，也将遵循修改后的协议内容使用本服务；若您不同意修改后的协议内容，您应停止使用本服务。</p>
      <h1>二、帐户注册及条款</h1>
      <p> 1、 您保证具有法律规定的完全民事权利能力和民事行为能力，能够独立承担民事责任的自然人、法人或其他组织；本协议内容不会被您所属国家或地区的法律禁止。</p>
      <p>2、具体操作使用人应该是自然人。不允许采用注册机或者类似的自动化方式注册账户。</p>
      <p>3、当您注册时应当按网站要求提供您真实的信息及其他必要的信息以完成注册。</p>
      <p>4、您的登录信息只能用于一个人，不允许多人共享登录信息。您可以在网站允许的前提下注册多个登录用户名密码。</p>
      <p>5、您应当保护好自己的用户名及密码信息不被泄露。“慧展云”无法也不会保护因为您泄露用户名或密码导致的数据风险。</p>
      <p>6、对于您以及您的账户所创建的内容负责，不得制作或传播违反国家法律法规的内容。</p>
      <p>7、您不得恶意攻击“慧展云”服务。</p>
      <p>8、您不得复制、转售或转授权任何部分或者全部的“慧展云”服务。</p>
      <p>9、我方有权但并非义务删除以下内容：非法、歧视、恐吓、诽谤、色情、淫秽或者违反中国法律的。</p>
      <p>10、您不得以口头或者文字方式攻击（包括恐吓、报复等）我方客户、员工、成员或本产品及服务的其他使用者。</p>
      <p>11、您不得上传或者发布垃圾邮件，短信，或上传计算机病毒程序或者恶意代码。</p>
      <p>12、如果您的账户流量使用明显超过平均用户带宽使用，我们保留停用您的账户的权利，直到您降低您的流量使用。</p>
      <p>13、您在本协议期间应遵守全部中国法律、法规和规章。</p>
      <p>14、如果我方因您的任何触犯中国法律法规的行为或违反本协议的行为而承受任何损失或损害，您应该采取所有行动使我方免于承担责任，并对由此产生的全部损失和损害承担赔偿责任。</p>
      <p>15、如果您存在任何触犯中国法律法规的行为或违反本协议的行为，我方有权根据行为的严重性自行决定立即暂停或终止您对本服务的使用，我方无须就服务暂停或终止对您承担任何责任，并且无须返还您已支付的费用。</p>

      <h1>三、付费相关条款</h1>
      <p>1、慧展云对您开放付费功能并通过第三方服务向用户提供付费服务。所有通过第三方服务支付的款项都遵守第三方的服务协议，慧展云不承担任何责任。您需自行承担任何由付费带来的后果。</p>
      <p>2、您有权自由选择决定是否使用“慧展云”中的付费产品、功能或服务。</p>
      <p>3、如果由于特殊情况慧展云没有收到您的支付款项，您的付费制作将不会启动，直至慧展云收到款项。您同意自行承担上述情况带来的风险和损失。 </p>
      <p>4、已成功付费并完成成片制作及充值到用户余额中的款项无法退还。 </p>
      <h1>四、产品服务条款</h1>
      <p>1、我方将以专业的方式提供产品及服务，但并不保证：</p>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;① 产品及服务满足您的所有需求或您的所有期待；</p>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;② 产品及服务没有任何失误或缺陷；</p>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;③ 产品及服务中的所有错误都会被修正。我方无须对任何第三方提供的产品或服务负责，亦不对第三方产品或服务提供任何保证。</p>
      <p>2、我方保留不断修改调整这项服务的权利，而无需事先通知您。</p>
      <h1>五、知识产权条款</h1>
      <p>1、您提交的各种内容版权归属于您。</p>
      <p>2、我方提供的服务及产品（包括但不限于观感、设计、图标、代码等）的版权、商标权、专利权及其他知识产权均归属于我方。除非获得我方明确书面允许，您不得复制、重用任何HTML/CSS,JavaScript或者任何视觉设计，也不得对我方产品进行反向工程、分解或进行编译或其他修改。</p>
      <p>3、本协议中未明确授予您的权利将由我方保留。</p>
      <h1>六、免责条款</h1>
      <p>对用户从慧展云获得的任何信息、内容或者广告宣传等任何视频（以下统称“信息”），我方均无法担保真实、准确和完整性，我方不对任何非与慧展云直接发生的交易和/或行为承担任何直接、间接、附带或衍生的损失和责任。</p>
      <p>1、您使用经由慧展云下载的或取得的任何资料，其风险自行负担；因该等使用导致用户电脑系统损坏或资料流失，用户应负完全责任。</p>
      <p>2、如您在慧展云不正当或非法使用产品服务、购买商品或者进行网络交易、未及时提供正确信息，而导致的所有直接或间接的损害，慧展云均不承担责任。</p>
      <p>3、慧展云对各项服务下涉及的境内外基础电信运营商的移动通信网络的故障、技术缺陷、覆盖范围限制、不可抗力、计算机病毒、黑客攻击、用户所在位置、用户关机或其他非慧展云技术能力范围内的事因等造成的服务中断、用户发送的短信息的内容丢失、出现乱码、错误接收、无法接收、迟延接收事项不作担保。</p>
      <p>4、用户经慧展云访问第三方网站时，除遵守本协议约定外，还应遵守第三方的用户协议。慧展云不保证通过第三方提供服务及内容的安全性、准确性、有效性及其他不确定的风险，由此若引发的任何争议及损害，与慧展云无关，慧展云不承担任何责任。</p>
      <h1>七、服务终止</h1>
      <p>1、您清楚地了解终止服务的后果。无需邮件或者电话确认，您可以在任何时候通过点击账户链接并执行相应操作来终止您的账户及相应的所有信息。</p>
      <p>2、一旦终止，所有隶属于该账户的数据及信息将由我方作删除处理，并且无法恢复。</p>
      <p>3、一旦终止账户，账户之下的用户将无法访问任何相关的服务，且我方对您或任何第三方都不承担任何责任。</p>
      <h1>八、其他条款</h1>
      <p>1、您了解我方使用第三方的运营商和网络提供商提供必要的硬件、软件、存储或网络来运行服务。我方无需因为第三方的、或者不在我方控制范围内的原因（如不可抗力）造成的运行问题（如服务中断、停顿、中止等）负责。 </p>
      <p>2、如果本协议的某一条款或某一条款的一部分无效或不可执行，不影响本协议其他条款的有效性，无效或不可执行的条款将被视作已从本协议中删除。</p>
      <p>3、本协议受中华人民共和国法律管辖。在执行本协议过程中如发生纠纷，双方应及时协商解决。协商不成时，任何一方均有权向我方所在地人民法院提起诉讼。</p>
      <p>4、若有任何疑问，请通过029-88166134联系方式与我们联系。</p>
    </div>
  </div>
</template>
<script>
export default {
  filters: {
    els: function(value) {
      const nums = 99
      if (!value) return ''
      if (value.length > nums) {
        return value.slice(0, nums) + '...'
      }
      return value
    }
  },
  async asyncData({ $axios }) {
    console.log($axios)
    console.log(process.env.NODE_ENV)
    const ip = await $axios.$get('/trpc.qqnews_web.pc_base_srv.base_http_proxy/NinjaPageContentSync?pull_urls=today_topic_2018')
    return { ip }
    // return { ip };
  },
  data() {
    return {

    }
  },
  mounted() {

  },
  destroyed() {
  },
  methods: {

  }
}
</script>
<style lang="scss" scoped>
.service-bg{
  height: 300px;
  display: flex;
  align-items: center;
  justify-content: center;
  font-size: 28px;
  background-color: aqua;
  color: #fff;
}
.service-page{
    .wrap{
        width:80%;
        margin:60px auto ;
        p{
          font-size: 13px;
          margin: 5px 0;
          line-height: 25px;
        }
    }

}

</style>
